Revit 2027 API
MassLevelData.StrUsage Property
 A String which describes the usage or occupancy type of the level of the MassLevelData.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string StrUsage { get; set; }
Public Property StrUsage As String
	Get
	Set
public:
property String^ StrUsage {
	String^ get ();
	void set (String^ value);
}
member StrUsage : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
MassLevelData Class
Autodesk.Revit.DB.Analysis Namespace